#Task: "Cinema BoxOffice"
#ShortDescription: As Visitor I want to have my age validated by the system So that control over ticker sales can be handled
#Details:
# Попросіть користувача ввести свсвій вік (можно використати константу або input()).
# - якщо користувачу менше 7 - вивести "Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести "Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"

a = 10
b = 20
if a < b:
    print('A')
    print('is')
    print('True')
else:
    print('B')
    print('is')
    print('True')