#Задача1: Створіть дві змінні first=10, second=30. Виведіть на екран результат математичної взаємодії (+, -, *, / и тд.) для цих чисел.
int1 = 10
int2 = 30
res = int1 + int2
print(res)
res = int1 * int2
print(res)
res = int1 / int2
print(res)
res = int1 - int2
print(res)
res = int1 ** int2
print(res)
res = int1 // int2
print(res)
res = int2 % int1
print(res)
print('Arithmetic actions done successfully')

#Задача2: Створіть змінну и по черзі запишіть в неї результат порівняння (<, > , ==, !=) чисел з завдання 1. Виведіть на екран результат кожного порівняння.
compare_result = int1 < int2
print(compare_result)
compare_result = int1 <= int2
print(compare_result)
compare_result = int1 > int2
print(compare_result)
compare_result = int1 >= int2
print(compare_result)
compare_result = int1 == int2
print(compare_result)
compare_result = int1 != int2
print(compare_result)
print('Comparison of variables is done successfully')

#Задача3: Створіть змінну - результат конкатенації (складання) строк str1="Hello " и str2="world". Виведіть на екран.
str1 = 'Hello'
str2 = 'world'
str3 = str1 + str2
print(str3)
print('Concatenation of string variables is made successfully')

